print("""┼┼┼┼┼┼┼┼┼┼┼┼████████████████
┼┼┼┼┼┼┼┼┼┼┼┼██▒██▒███▒██▒███
┼┼┼┼┼┼┼┼┼┼┼███████▒█▒████████
┼┼┼┼┼┼┼┼┼┼┼████████▒█████▒█▒█
┼┼┼┼┼┼┼┼┼┼████████▒█▒█████▒███
┼┼┼┼┼┼┼┼┼┼████▒██▒███▒███▒█▒██
┼┼┼┼┼┼┼┼┼████▒▒▒███████████████
┼┼┼┼┼┼┼┼┼████▒▒▒████████████▒██
┼┼┼┼┼┼┼┼████▒▒▒▒▒███▒█▒█████████
┼┼┼┼┼┼┼████▒▒▒▒▒▒▒██▒█▒███▒█▒████
┼┼┼┼┼┼████▒▒▒▒▒▒▒▒▒███████▒█▒█████
┼┼┼┼┼████▒▒▒▒▒▒▒▒▒▒▒███████████████
┼┼┼┼┼████▒▒▒▒▒▒▒▒▒▒▒███████▒███▒███
┼┼┼┼████▒▒▒███████▒▒▒███████████████
┼┼┼┼████▒▒▒█░░█░░█▒▒▒████▒███▒██████
┼┼┼████▒▒▒▒███████▒▒▒▒█████▒█████▒███
┼┼████▒▒▒▒▒█░░█░░█▒▒▒▒▒███▒█▒███▒█▒███
┼┼████▒▒▒▒▒█░░█░░█▒▒▒▒▒██▒███▒████████
┼████▒▒▒▒▒▒███████▒▒▒▒▒▒████████████▒██
█████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒███████████████
┼┼┼┼█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒█▒█▒█▒█▒█▒█
┼┼┼┼█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████████
┼┼┼┼█▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████████
┼┼┼┼█▒▒▒█░█░█░█░█░█░█▒▒▒████▒▒▒▒▒▒▒███
┼┼┼┼█▒▒▒█████████████▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒█░█░░░█░░░█░█▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒███░░░█░░░███▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒█░█░░░█░░░█░█▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒█████████████▒▒▒████▒▒▒▒▒▒▒███
┼┼┼┼█▒▒▒█░█░░░█░░░█░█▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒███░░░█░░░███▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒█░█░░░█░░░█░█▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒█████████████▒▒▒████▒░░▒░░▒███
┼┼┼┼█▒▒▒█░█░░░█░░░█░█▒▒▒████▒▒▒▒▒▒▒███
┼┼┼┼█▒▒▒███░░░█░░░███▒▒▒██████████████
┼┼┼┼█▒▒▒█░█░░░█░░░█░█▒▒▒██████████████
""")
print("Welcome, You are now locked inside an old house and there are three rooms in front of you.")
room= input("which room will you chose? ( first 🚪, or second 🚪, or third 🚪) \n").lower()

if room == "first":
    print("Oops! You opened a room with fire.🔥🔥🔥")
    print("Game over! 😵")
elif room == "third":
    print("Oops! You opened a room with a lion inside. 🦁🦁🦁")
    print("Game over! 🫣")
elif room == "second":
    print("Great, Now you have two cabinets in front of you!")
    chose= input("which cabinet will you chose? ( A 🔓, or B 🔓? )\n").lower()
    if chose == "a":
        print("Oops! You opened a cabinet full of bats.🦇🦇🦇")
        print("Game over! 😓")
    elif chose == "b":
        print("Nice! You have found a crypt.🪜")
        print("Now you have go crypt ,you found two piston!")
        presses= input("wich pistons you will press? ( first piston 🎣,or second piston 🎣?) \n ").lower()
        if presses == "first piston":
            print("You dead😱😱")
        elif presses == "second piston":
            print ("Congratulations! you have finally found a way out! 🤩🥳🥳")
        else:
            print("Sorry, but i can not understand this choice! 🤷‍♂️🤷‍♂️🤷‍♂️")
    else:
        print("Sorry, but i can not understand this choice! 🤷‍♂️🤷‍♂️🤷‍♂️")
else:
    print("Sorry, but i can not understand this choice! 🤷‍♂️🤷‍♂️🤷‍♂️")